In [3]:
import numpy as np
import pandas as pd

# Dataframe.pipe() is for whole tables

In [5]:
def extract_city_name(df):
    df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
    return df

def add_country_name(df, country_name=None):
    col = 'city_name'
    df['city_and_country'] = df[col] + country_name
    return df

df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})
df_p

  city_and_code
0   Chicago, IL

In [6]:
add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [7]:
(df_p.pipe(extract_city_name).pipe(add_country_name, country_name="US"))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

# Dataframe.apply() is for rows and columns

In [8]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a  2.879219 -0.248548       NaN
b  1.261072 -0.588684 -2.255816
c -0.633524 -1.791992  0.532489
d       NaN -0.295176 -0.950223

In [9]:
df.apply(np.mean)

one      1.168922
two     -0.731100
three   -0.891183
dtype: float64

In [13]:
np.mean(df)

one      1.168922
two     -0.731100
three   -0.891183
dtype: float64

In [16]:
df.apply(np.mean, axis=1)

a    1.315336
b   -0.527810
c   -0.631009
d   -0.622699
dtype: float64

In [17]:
df.apply(lambda x: x.max() - x.min())

one      3.512743
two      1.543444
three    2.788306
dtype: float64

In [18]:
# cumsum means cumilative sum
df.apply(np.cumsum)

        one       two     three
a  2.879219 -0.248548       NaN
b  4.140291 -0.837232 -2.255816
c  3.506767 -2.629224 -1.723327
d       NaN -2.924400 -2.673550

In [19]:
df.apply(np.exp)

         one       two     three
a  17.800371  0.779932       NaN
b   3.529202  0.555057  0.104788
c   0.530718  0.166628  1.703167
d        NaN  0.744401  0.386655

In [20]:
def own_function(x):
    return x*x

In [21]:
df.apply(own_function)

        one       two     three
a  8.289904  0.061776       NaN
b  1.590302  0.346549  5.088708
c  0.401353  3.211234  0.283545
d       NaN  0.087129  0.902923

In [27]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

In [28]:
df.apply(subtract_and_divide, args=(5,3))

        one       two     three
a -0.706927 -1.749516       NaN
b -1.246309 -1.862895 -2.418605
c -1.877841 -2.263997 -1.489170
d       NaN -1.765059 -1.983408

In [31]:
def subtract(x, sub):
    return (x - sub)

df.apply(subtract, args=(5,))

        one       two     three
a -2.120781 -5.248548       NaN
b -3.738928 -5.588684 -7.255816
c -5.633524 -6.791992 -4.467511
d       NaN -5.295176 -5.950223

In [26]:
df

        one       two     three
a  2.879219 -0.248548       NaN
b  1.261072 -0.588684 -2.255816
c -0.633524 -1.791992  0.532489
d       NaN -0.295176 -0.950223